Revit 2026 API

# IndexStreamTriangleAddTriangles Method

---
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddTriangles(
	IList<IndexTriangle> triangles
)
```
```vb
Public Sub AddTriangles (
	triangles As IList(Of IndexTriangle)
)
```
```cpp
public:
void AddTriangles(
	IList<IndexTriangle^>^ triangles
)
```
```fsharp
member AddTriangles :
        triangles : IList<IndexTriangle> -> unit
```

#### Parameters

triangles IListIndexTriangle

#### Reference

IndexStreamTriangle Class

Autodesk.Revit.DB.DirectContext3D Namespace